{"id":269,"date":"2024-10-09T20:48:48","date_gmt":"2024-10-09T18:48:48","guid":{"rendered":"https://portfolio.level12.linuxpl.eu/?page_id=269"},"modified":"2025-10-02T18:57:17","modified_gmt":"2025-10-02T16:57:17","slug":"strona-glowna-tresc-nad-projektami","status":"publish","type":"page","link":"https://portfolio.level12.linuxpl.eu/strona-glowna-tresc-nad-projektami/","title":{"rendered":"Strona główna &#8211; treść nad projektami"},"content":{"rendered":"\u003Cdiv\u003E\u003Cb\u003ETam gdzie jest to możliwe dodaje link do działającej realizacji, w opisie dodaję przybliżone daty zawierające początek powstania projektu i ostatnią datę edycji pliku/ów.\u003C/b\u003E\u003C/div\u003E\r\n\u003Cb\u003ERelatywnie większe projekty i/lub te które bardziej pasują do profilu szukanej pracy i/lub z czymś ciekawym do pokazania starałem się dać wyżej w kolejności oraz dodałem krótki opis.\u003C/b\u003E\r\nZbiór projektów pamiętających jeszcze czasy Bootstrapa v3 i v4, PrestaShop 1.6 itp. Najświeższy klocek pracy z &#8222;branży&#8221; to &#8222;Bezpieczeństwo i administrowanie WordPress&#8221;","protected":false},"excerpt":{"rendered":"Tam gdzie jest to możliwe dodaje link do działającej realizacji, w opisie dodaję przybliżone daty zawierające początek powstania projektu i ostatnią datę edycji pliku/ów. Relatywnie większe projekty i/lub te które bardziej pasują do profilu szukanej pracy i/lub z czymś ciekawym do pokazania starałem się dać wyżej w kolejności oraz dodałem krótki opis. Zbiór projektów pamiętających [&hellip;]","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-269","page","type-page","status-publish","hentry"],"acf":{"read-more-text-before":"\u003Cdiv class=\"read-more-container\"\u003ESzanowny potencjalny pracodawco, jeżeli masz czas na czytanie moich wniosków odnośnie pracy w dwóch agencjach reklamowych, kliknij \u003Cbutton class=\"btn btn-primary read-more\" type=\"button\" data-bs-toggle=\"collapse\" data-bs-target=\"#read-more-txt\" aria-expanded=\"false\" aria-controls=\"collapseExample\"\u003ECzytaj więcej\u003C/button\u003E","read-more-text":"\u003Cdiv id=\"read-more-txt\" class=\"collapse\"\u003E\r\n                \u003Cdiv class=\"card card-body\"\u003E\u003Cb\u003EPodsumowanie doświadczenia, o jakości kodu i itp.\u003C/b\u003E Potraktuje tą stronę bardziej jako bloga. Zapis moich poczynań, który może posłużyć jako portfolio, ale również będzie informacją dla mnie, przypomnieniem co robiłem w konkretnym projekcie. Dlatego część opisów może nie być tak \"treściwa\" czy zwięzła jak powinna być w przedstawieniu dla potencjalnego pracodawcy.\u003Cbr/\u003ENie ma ludzi idealnych. Z każdego doświadczenia możemy wyciągnąć pożyteczne wnioski, byle by na końcu zachodziła równowaga, zgadzał się rachunek plusów i minusów najlepiej z korzyścią w kierunku tych pierwszych. Sam nie jestem raczej osobą od pomysłów, dlatego mimo, że poruszę tutaj pewne kwestie, które delikatnie zahaczają o ocenę funkcjonowania firm, w których pracowałem, to i tak podchodzę z szacunkiem do tego co robią bardziej przedsiębiorcze osoby ode mnie.\u003Cbr/\u003E\u003Cbr/\u003ECo mi się często nie podobało w projektach, a miało wpływ na ich wykonanie? Trochę mnie usprawiedliwiając (przy okazji) - najczęściej były to \"proste\" budżetowe strony \"wizytówki\", klient dostawał unikalny graficznie projekt, natomiast nie dostawał pewnie wielu rzeczy, które są często ważniejsze, czyli np. SEO. Oczywiście nie neguje totalnie takiego podejścia, było to modus operandi jednej z firm do części klientów, mi osobiście bardziej podobało się zasada działania drugiej firmy, która dawała klientowi wybór czy chce gotowy płatny szablon dla Wordpressa, wtedy tą zaoszczędzoną (teoretycznie) część budżetu można było przeznaczyć na widoczność w sieci. Chodzi generalnie o to, że dla tak małych budżetów na projekt myślę, że w dzisiejszych czasach wygląd strony mógłby lądować na nieco dalszym planie.\r\n                Podejrzewam, że część klientów zamiast grafiki odnoszącej się kolorystycznie do logo wolałaby kupić jakiś gotowy wygląd strony, a resztę przeznaczyć na pozycjonowanie dzięki temu my (twórcy) moglibyśmy zapewnić sobie spokój kiedy klient przyjdzie po tygodniu od skończenia projektu i powie \"czemu strony nie ma w google\" - chociaż na dużą część takich przypadków nic nie poradzimy oprócz grzecznego wytłumaczenia jak działa świat...SEO.\u003Cbr\u003E\u003Cbr\u003EIlość rzeczy, które musi zawierać nawet najprostszy projekt plus dodatkowe potrzeby użytkownika oraz np. to, że strona musi być responsywna, sprawiało, że produkt końcowy był może zadowalający dla klienta, ale pod względem programistycznym nieoptymalny. Oczywiście posypuje głowę popiołem i przyznaje się, że mogłem częściej wprowadzać poprawki do systemu, które nie wymagały dużego zaangażowania czasowego, ale poprawiły by jakość kodu, niestety robiłem to rzadziej niż powinienem bo wiązałoby się to zazwyczaj z dodatkowymi nadgodzinami, byłem odpowiedzialny za czas dostarczenia realizacji więc każda godzina była ważna, projekt gonił projekt itd...\u003Cbr/\u003E\u003Cbr\u003E\r\n                Różnorodność systemów, z którymi miałem do czynienia pracując w dwóch agencjach reklamowych przyprawia o zawrót głowy, samych wersji DOGO Systemu czyli CMSa autorskiego było 4-5, dwa różne systemy tworzone przez dwóch różnych programistów uaktualniane przez lata pracy.\u003Cbr\u003E\u003Cbr\u003E               \r\n                71 prezentowanych poniżej projektów to jakieś 60%-75% wszystkich stron/sklepów zrobionych własnoręcznie w ostatniej pracy jaką wykonywałem przez 6 lat i 4 miesiące. Dodatkowo w trakcie pracy nad głównym projektem było wykonywanych wiele zadań w tak zwanym międzyczasie. Tutaj jeszcze trzeba by dodać kilkanaście projektów z poprzedniej Agencji Reklamowej, w której pracowałem na początku swoich zmagań. Wtedy nie wpadłem na to żeby stworzyć sobie portfolio, także nie mam ani zdjęć, ani kodu tamtejszych projektów.\r\n                \u003C/div\u003E\r\n            \u003C/div\u003E\r\n            \u003Cbr/\u003E\u003Cbr/\u003E"},"_links":{"self":[{"href":"https://portfolio.level12.linuxpl.eu/wp-json/wp/v2/pages/269","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https://portfolio.level12.linuxpl.eu/wp-json/wp/v2/pages"}],"about":[{"href":"https://portfolio.level12.linuxpl.eu/wp-json/wp/v2/types/page"}],"author":[{"embeddable":true,"href":"https://portfolio.level12.linuxpl.eu/wp-json/wp/v2/users/1"}],"replies":[{"embeddable":true,"href":"https://portfolio.level12.linuxpl.eu/wp-json/wp/v2/comments?post=269"}],"version-history":[{"count":10,"href":"https://portfolio.level12.linuxpl.eu/wp-json/wp/v2/pages/269/revisions"}],"predecessor-version":[{"id":463,"href":"https://portfolio.level12.linuxpl.eu/wp-json/wp/v2/pages/269/revisions/463"}],"wp:attachment":[{"href":"https://portfolio.level12.linuxpl.eu/wp-json/wp/v2/media?parent=269"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]}}